rails-projects/linl-api/app/controllers/api/v1/users.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
SELECT "residences".* FROM "residences"  WHERE "residences"."user_id" = $1
---
      namespace 'users/:user_id' do
        resource :residences do
          get "" do
            residences = User.find(params[:user_id]).residences

SELECT "residences".* FROM "residences"  WHERE "residences"."user_id" = $1
---
          end

          get ":resource_id" do
            residence = User.find(params[:user_id]).residences.find(params[:resource_id])