rails-projects/linl-api/app/controllers/api/v1/entities/user_entity.rb

          :current_earnings_cents, :final_year_earnings_cents
        expose (:partner) { |entity| entity.partner ? entity.partner.id : []}
        expose (:partner) { |entity| entity.partner ? entity.partner.id : []}
        expose (:children) { |entity| entity.children ? entity.children.pluck(:id) : []}
        expose (:residences) { |entity| entity.residences ? entity.residences.pluck(:id) : [] }
---
SELECT "children"."id" FROM "children"  WHERE "children"."user_id" = $1
SELECT "residences"."id" FROM "residences"  WHERE "residences"."user_id" = $1